Autodesk.Revit.DB.Area.AreaScheme
The area scheme.

Autodesk.Revit.DB.Area.IsGrossInterior
The boolean value that indicates whether the area is gross interior.

Autodesk.Revit.DB.Area
Provides access to the area topology in Autodesk Revit.
Remarks: The area object can be queried for its boundary for use in space planning tools.